---
kind: method
id: M:Autodesk.Revit.DB.Element.IsMonitoringLinkElement
zh: 构件、图元、元素
source: html/fde81756-5518-4924-c14e-f9ef2bb3fa6e.htm
---
# Autodesk.Revit.DB.Element.IsMonitoringLinkElement Method

**中文**: 构件、图元、元素

Indicate whether an element is monitoring any elements in any linked models.

## Syntax (C#)
```csharp
public bool IsMonitoringLinkElement()
```

## Returns
True if this element is monitoring elements in a linked models. Otherwise, false will be returned.